#변수
#변수 : 자료 처리를 위해 이름이 부연된 메모리 공간
# 변수명 : 
# 규칙 
# A-Z , a-z , 0-9 
# 대소문자구분
# 첫글자는 문자 (숫자로 시작할수 없다 )
# 단_ 시작가능
# 특수문자는 사용할수 없다.(+,-,*,/,$,@,&,%)
# 예약어 x (if, for, while , and , or , ...) 
# 의미 있게 

# 1. _As99   2. 9ac#wd3  3. abcdFFsstt99@.@  4. ssvvkkcc55
# 5. 대박    6. 중박     7. 소박                              





animal = "고양이"   #변수 설정 
name = "해피"       #변수 설정 
age = 2             #변수 설정 
hobby = "잠자기"    #변수 설정 


print("우리집",animal +"는",name+"입니다" )      #변수 대입  
print(age,"살 입니다. ")                         #변수 대입 
print("우리",name+"는" ,hobby+"을 좋아해요")     #변수 대입 






